app/views/shared/_user_info.html.erb

SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = ?  [["user_id", 1]]
---
<span><%= link_to "프로필 보기", current_user %></span>
<span><%= "#{current_user.microposts.count}개의 시" %></span>