app/controllers/users_controller.rb

  def update
    @user = User.find(params[:id])
    if @user.update_attributes(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "email" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "example@naver.co.kr"], ["password_digest", "$2a$10$FVSijq5V9h2Por9Asi7uoeDI3Q4SKuX22tp35LE9BIht2Wts1HIUu"], ["updated_at", "2017-06-24 11:17:09.985015"], ["id", 3]]